/*Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.
5 -> 2, 4
8 -> 2, 4, 6, 8*/

Console.Clear();
Console.Write("Write number 1: ");
int N=int.Parse(Console.ReadLine());
Console.Write("Write number 2: ");
int m = int.Parse(Console.ReadLine());
while (int i = n; i <= m; i++)
{
    Console.WriteLine($"{B} ");
    B++;
}
